#
# @Time   : 2022/10/20
# @Author : wuBerlin
# @File   : day2.py

# 逢7拍手
for i in range(1, 101):
    if  i%7==0:
        print("拍手一次",i)
        continue
    print(i)
#     切片操作格式  a[start,end,step]


#   list列表 是有序的格式用[] 括起来==============================列表
a=[1,2,3,4]
a.append(5)  #追加单个元素
a
[1, 2, 3, 4, 5]
a.extend(10,20,30,40)

a
[1, 2, 3, 4, 5]
t=(10,20,30)
a.extend(t)#追加多个元素
a
[1, 2, 3, 4, 5, 10, 20, 30]
a.insert(5,80)#插入一个元素，格式为（位置，参数）
a
[1, 2, 3, 4, 5, 80, 10, 20, 30]
a[5]=100#替换一个元素 可以用  “=”  list[位置]
a
[1, 2, 3, 4, 5, 100, 10, 20, 30]
a.remove(30)#删除一个元素，用remove
a
[1, 2, 3, 4, 5, 100, 10, 20]
# 用tuple元组是无序的，格式用（）括起来，也可省略，可迭代==========================元组
# 集合用set表示，集合中不可以有重复的元素，无序，可迭代=========================集合
# 可直接创建 set（“hello”）， 或者用大括号陈列{“h”，“e”，“l”， “o”}{10,20,30,40}
# 修改集合用====add()添加元素。remove()删除元素。clear()清空元素
#  字典类型用dict表示，可迭代，通过键(key)来访问元素的可变的容器类型的数据。=====================字典
# key（）中不可出现重复的元素，值视图value（）可以键和值是成对出现的
# 创建字典的格式为 dict(key1:value1,key2:value2...,)
# dict(((108:"张三")， (109:"李四")))//元组
# dict([(108:"张三")]， [(109:"李四")])//列表
# dict({108:"张三"， 109:"李四"})//集合
# dict(zip([108,109,110],["张三","李四","王五"]))
# zip()可把参数打包成元组
# 字典同样可以添加，删除，替换，，，不过注意，键值对是同时变化的
dict1={102:"zhang", 105:"li", 106:"wu"}
dict1[102]
'zhang'
dict1[107]="bo"
dict1
{102: 'zhang', 105: 'li', 106: 'wu', 107: 'bo'}
dict1[105]="wu"
dict1
{102: 'zhang', 105: 'wu', 106: 'wu', 107: 'bo'}
dict1.pop(107)# 字典删除用pop()
'bo'
dict1
{102: 'zhang', 105: 'wu', 106: 'wu'}

#    三种访问字典视图的方式
# items():返回字典的所有键值对视图
# keys():返回字典键视图
# values():返回字典值视图
# 例  dict1.items()

